<template>
 <Popup
    :close-on-click-overlay="false"
    :value="value"
    class="register-protocol"
    >
    <div class="content">
        <icon name="iclose" @click="handleClose"/>
        <h3><img :src="require('assets/motao.png')" alt="">用户协议</h3>
    <div class="text">
<section>
摩萄盒子客户端软件（以下可简称“本软件”） 各项电子服务的所有权和运作权归属于广东思理智能科技股份有限公司（以下筒称“思理公司”)，本软件提供的服务将完全按照其发布的服务条款和操作规则严格执行。
您通过注册程序阅读本《摩萄盒子用户服务协议》（以下简称“服务协议”）并点击“同意”或“注册”按钮注册成为摩萄盒子用户（以下可简称“用户”)或以“思理公司”允许的其他方式实际使用本软件功能，表示您已充分阅读、正确理解并完全接受本协议的全部内容。若您您不同意本协议内容、无法准确理解条款的解释或对本协议的条款存在任何疑问或异议，应立即停止注册、使用思理公司提供的服务。
</section>
<section>
1、服务说明
1.1思理公司依法为用户提供摩萄盒子24小时无人值守便利店商品采购与费用结算等服务, 所涉及的具体商品奖由有资质的供应商提供。
1.2思理公司保留随时修改或中断服务而不需通知用户的权利。思理公司行使修改或中断服务的权利，不需对用户或第三方负责，但因此导致用户直接损失的除外。
1.3用户必须自行准备如下设备和承担如下开支：
1.3.1上网设备，包括但不限于手机或者其他上网终端、调制解调器及其他必备的上网装置。
1.3.2上网开支，包括但不限于手机流量费等。
</section>
<section>
2、用户注册信息与账号安全管理
2.1用户在操作注册时, 应按系统提示通过绑定手机或微信账号关注“摩萄盒子”公众号的方式成为摩萄盒子用户，用户同意思理公司为履行本协议之目的获取用户的手机和/或微信之相关信息，用户承诺在操作注册过程中所提供的注册资料真实、准确、完整、合法、有效，用户注册资料如有变动的，应及时更新。同时，用户所选用的用户名、设置的账户昵称（如有）不得侵犯他人合法权益、违反相关法律法规。否则，思理公司有权拒绝用户注册、 收回注册的贴号以及暂停或终止用户使用本软件的全部或部分服务，因此引起的相应责任及后果由用户自行承担，用户不得将此作为取消交易、拒绝付款的理由。
2.2用户在注册成功后，应谨慎合理的保存、使用账户，不得供第三人使用或向他人泄露，用户应对所注册的账户发生的一切行为承担相应的法律责任。 用户若发现任何非法使用注册帐户或存在安全漏洞的情况，可立即通知思理公司依据用户请求采取行动需要合理期限，在此之前，对已执行的指令及（或）所导致的用户损失不承担任何责任。
</section>
<section>
3、用户授权思理公司行使下列权利
3.1思理公司有权通过站内信、邮件、短信、电话以及网络通讯工具等, 向用户发送订单信息、促销活动等告知信息。用户可以按照思理公司提供的相应设置或方法, 拒绝该类信息服务
3.2使用用户的注册信息、用户名、密码等信息，登录进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。
</section>
<section>
4、服务使用基本规则
4.1用户同意严格遵守以下义务。
4.1 1不得删除本软件及其副本上关于著作权的信息。
4.1.2不得对本软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本软件的源代码。
4.1.3不得对思理公司拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等。
4.1.4不得对本软件或者本软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及本软件运行所必需的系统数据，进行复制、修改、増加、删除、挂接运行或创作任何衍生作品，形式包活但不限于使用插件、外挂或非经思理公司授权的第三方工具/服务接入本软件和相关系统。
4.1.5不得通过修改或伪造软件运行中的指令、数据、增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的。
4.1.6 不得通过非思理公司开发、授权的第三方软件、插件、外挂、系统，登录或使用思理公司软件及服务，或制作、发布、传播上述工具。
4.1.7不得自行或者授权他人、第三方软件对本软件及其组件、模块、数据进行干扰。
4.1.8不得利用本软件从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动。
4.1.9不得利用在本软件进行牟利性经营活动。
4.1.10不得在未经思理公司许可的情况下，对外售卖会员积分、会员权限或其他优惠条件(或政策)，该售卖行为包括但不限于用户允许第三方买家使用其所持有的本软件账户内的会员积分、会员权限以及与该账户绑定的优惠条件(或政策)等。
4.2如用户遵守以上义务，思理公司有权作出独立判断并采取终止或中断用户使用服务、 注销或冻结用户账户、收回用户账户中已有的会员积分、冻结用户账户中的预存的消费额度、取消（或降低）特殊会员资格（权限）、删除或修改用户发布的信息等措施，并依法追究用户的法律责任。
4.3思理公司如发现用户存在涉嫌违反本协议的情形，有权进行调査，要求用户对账户的异常行为进行说明并提供证据资料。在此期间，本软件有权暂时冻结用户账户、中止提供服务,但调查结果应在60日内告知用户。
</section>
<section>
5、知识产权保护
5.1本软件以及思理公司提供服务过程中所有知识产权（包括但不限于著作权、专利、商标、服务标识、商号、设计，不论是否已登记注册）、信息内容、运营的数据库、网站设计、文字与图片、软件、照片、录像、音乐、声音及其前述组合，以及所有软件编译、相关源代码和软件（包括小应用程序和脚本）均为思理公司（或相关许可方）所有，受法律保护。
5.2未经思理公司事先书面同意，上述任何材料用户均不得通过任何形式用于商业目的， 包括但不限于复制、转发、拷贝、分发、再版、下裁、展示、张贴或传送，亦不得以任何方式出售、出租或转租，用于制作改编作品、或以任何方式开发利用。
5.3用户在使用服务过程中获得的任何信息的相关权利、所有权和知识产权为该信息所有人的财产，受有关著作权法或其他法律法规的保护。用户在本协议项下不对该等信息享有任何权利。
</section>
<section>
6、订单
用户使用本软件下订单，应具备购买相关商品的权利能力和行为能力，如果用户在18周岁以下，需要在父母或监护人的监护参与下才能使用本软件。 下订单的同时，即视为用户满足上述条件，并对用户在订单中提供的所有信息的真实性负责。
</section>
<section>
7、隐私保护
7.1思理公司承诺保护用户的个人稳私，仅以合法方式（根握《互联网信息服务管理办法》及其他有关数据保护的法规）收集和使用用户的信息。
7.2思理公司收集（或保存）的用户个人标识信息，一般为用户在注册时或回复某项信息请求时自愿提供的信息。未经用户的明确同意，思理公司不收集用户的任何敏感信息。
7.3如用户通过后台系统操作或其他形式的告知，更新用户个人的信息数据时，思理公司应及时更新用户的个人数据。
7.4思理公司应将用户个人标识信息信据相关法律法规进行保护与保存，不得为任何第三方的营销目的而向其披露、出售或出租用户的个人信息。
   此外，思理公司始终有权为以下目的披露用户个人专有信息：
（1）为了更好地向用户提供服务并对本软件进行广告宣传的。
（2）用户同意让第三方共享资料的：
（3）用户同意公开其人个资料，享受为其提供的产品和服务的；
（4）国家法律法规或地方性规章制度所规定的；
（5）回复政府部门或准政府部门的质询的；
（6）依法保护本软件和/或本网站的其他用户的权利或财产的。
 同时，思理公司有权将用户的个人标识信息提供给本软件的代理商和分包商、合作商，以帮助本软件按照本政策的规定使用用户的数据。例如，本软件可能将该信息发送至服务商以完成付款程序。
7.5 如果思理公司发生任何出售、合并、兼并、控制权变更、重大资产转让、出售或让与本软件站收集的信息（包括但不限于个人专有信息和其他信息）。
</section>
<section>
8、免表条款
8.1 用户可以直接从摩萄盒子的官方网站上获取本软件, 也可以从得到思理公司授权的第三方获取, 如果用户从未经思理公司授权的第三方获取本软件或与本软件名称相同的安装程序、微信公众号或小程序，思理公司无法保证该软件能够正常使用，并对因此给用户造成的损失不予负责。
  8.2 用户知晓并理解，本软件会不定期的出现系统维护、升级等情况，且思理公司可能对服务或功能进行升级、调整，如因上述原因暂停网络服务或原服务、功能发生变化的，思理公司将尽可能事先在网站上进行通告，且不应影响已生成订单的执行。
</section>

<section>
9、争议解决
如因在履行本协议或用户使用本软件服务过程中发生争议的，用户与思理公司应协商解决，如协商不成的，任何一方均可向思理公司所在地有管辖权的人民法院提起诉讼。
</section>

<section>
10、服务条款的完善和修改
10.1本服务协议内容包括协议正文及所在本软件已发布的或将来可能发布的各类规则。所有规则为协议不可分割的一部分，与协议正文具有同等法律效力。
10. 2 思理公司可根据互联网行业发展、业务形态变化以及中华人民共和国有关法律、法规的更新，不时地完善和修改本服务协议内容。用户在使用本软件服务时，有必要对最新的服务协议内容进行仔细阅读和重新确认，用户继续使用思理公司提供的服务，视为同意并愿遵守最新的服务协议内容。
</section>

</div>
  </div>
 </Popup>
</template>
<script>
import {Icon, Popup} from 'vant';
export default {
  props: {
    value: {
      type: Boolean,
      default: false
    },
    text: {
      type: String,
      default: ''
    }
  },
  methods: {
    // 关闭
    handleClose () {
      this.$emit('input', false);
    }
  },
  components: {
    Icon,
    Popup
  }
};
</script>
<style lang="less" scoped>
@import '~@/assets/color.less';
.register-protocol{
    border-radius: 0.2rem;
    .van-icon-iclose {
        position: absolute;
        right: 0.15rem;
        top: 0.1rem;
        font-size: .5rem;
        opacity: 0.43;
    }
    h3 {
        font-size:0.4rem;
        color: #1B1B1B;
        line-height: 0.7rem;
        display: flex;
        justify-content: center;
        text-indent: 1em;
        margin: 0 0 .2rem 0;
        img {
            height: 0.7rem;
        }
    }
    .content{
        width:6.5rem;
        height: 8.98rem;
        padding: 0.4rem;
        box-sizing: border-box;
        overflow: auto;
        .text {
            height: 6.28rem;
            overflow: auto;
            -webkit-overflow-scrolling: touch;
            text-align: left;
            section{
                margin: .2rem 0;
            }
        }
    }
}
</style>
